app/controllers/recursousuarios_controller.rb

SELECT `recursousuarios`.* FROM `recursousuarios`
---
  def index
    @recursousuarios = Recursousuario.all

INSERT INTO `recursousuarios` (`email`, `cedula`, `libro`, `idlibro`, `created_at`, `updated_at`) VALUES ('@anyeliyh', '123456789', 'una rosa', 1, '2017-07-25 19:48:01', '2017-07-25 19:48:01')
---
  def create
    @recursousuario = Recursousuario.new(recursousuario_params)

    respond_to do |format|
      if @recursousuario.save

UPDATE `recursousuarios` SET `email` = '@anyelith', `updated_at` = '2017-07-25 21:27:12' WHERE `recursousuarios`.`id` = 1
---
  def update
    respond_to do |format|
      if @recursousuario.update(recursousuario_params)

SELECT  `recursousuarios`.* FROM `recursousuarios` WHERE `recursousuarios`.`id` = 1 LIMIT 1
---
    def set_recursousuario
      @recursousuario = Recursousuario.find(params[:id])