app/controllers/recursos_controller.rb

  def index
    @recursos = Recurso.all
---
SELECT `recursos`.* FROM `recursos`

  def create
    @recurso = Recurso.new(recurso_params)

    respond_to do |format|
      if @recurso.save
---
INSERT INTO `recursos` (`titulo`, `nombre`, `editorial`, `created_at`, `updated_at`) VALUES ('carritos', 'anyelith', 'norma', '2017-07-25 16:32:59', '2017-07-25 16:32:59')

    def set_recurso
      @recurso = Recurso.find(params[:id])
---
SELECT  `recursos`.* FROM `recursos` WHERE `recursos`.`id` = 1 LIMIT 1